package com.example.testdemo;

public interface readme_dlt {

    /**
     *
     * str20230729 086: 3,11,15,20,35-7,11  3-5-null-4  4-4-0-0
     * str20230726 085: 11,12,26,31,35-5,7  3-5-null-3  4-4-null-0
     * str20230724 084: 3,5,8,24,32-7,8     3-5-null-2  4-4-1-1
     * str20230722 083: 13,15,21,25,32-9,10 3-5-null-6  4-4-0-1
     * str20230701 074: 3,13,22,29,34-2,9   3-5-null-5  4-4-0-1
     * str20230628 073: 15,25,28,30,35-8,10 3-5-null-7  4-4-0-1   4-4-1-1  5-5-0-1
     *
     * */




    /**
     *               minPreMatchNum  前区最少匹配个数
     *      * @param maxPreMatchNum  前区最大匹配个数
     *      * @param subMatchNum  后区匹配个数
     *      * @param minMatchNum 允许在已有号码内匹配的最大注数量
     *      * @param maxMatchNum 允许在已有号码内匹配的最大注数量
     *      * @param maxRepeatNum
     *                                minPreMatchNum   maxPreMatchNum  subMatchNum  minMatchNum   maxMatchNum  maxRepeatNum   前区最高频率12内命中个数   前区最高频率10内命中个数  前区最高频率8内命中个数
     *  大乐透
     *  073：15,25,28,30,35-08,10            3               4           null            1             6             3
     *  073：15,25,28,30,35-08,10            3               3              1            3             3             3
     *  073：15,25,28,30,35-08,10            3               3              2            1             1             3
     *  073：15,25,28,30,35-08,10            4               4              1            2             2             3                  4                     3                   1
     *  072：05,06,09,11,14-02,04
     *  071：02,11,12,32,34-10,12
     *  070：10,26,29,32,33-03,11
     *  --------
     *  双色球
     *
     *
     *
     * */
    //minPreMatchNum|maxPreMatchNum|subMatchNum|minMatchNum|maxMatchNum|maxRepeatNum,
    /**
     * 统计反向
     *                                  实验次数   前区最高频率15内命中个数  前区最高频率12内命中个数  前区最高频率10内命中个数   前区最高频率8内命中个数   前区最高频率5内命中个数     后区7内命中个数   后区3内命中个数
     *    大乐透
     *  074：3,13,22,29,34-2,9
     *        4-4-0-1-3-3                100000            4                 4                     3                   3                                                2              1
     *
     *
     *
     *
     *  073：15,25,28,30,35-08,10        100000                               4                     3                   1
     *        4-4-1,0                    100000            4                 3                     3                   3                                                2              1
     *                                   100000            4                 4                     3                   3                                                2              1
     *                                   100000            4                 4                     3                   3                                                2              1
     *                                   100000            4                 4                     3                   3                                                2              1
     *                                   100000            4                 4                     3                   3                                                2              1
     *                                   500000            4                 4                     3                   3                         3                      2              1
     *                                   500000            4                 4                     3                   3                         3                      2              1
     *                                   500000            5                 4                     3                   3                         3                      0              0
     *                                   500000            5                 4                     3                   3                         3                      0              0
     *        4-4-1
     *                                   500000            5                 4                     3                   3                         2                      2              1
     *
     *
     *
     *
     *
     *
     *
     */



}
